// 스코프
// 변수나 함수의 유효범위
// 어디에 선언되었는지에 따라서 접근 가능 여부가 달라진다.

// 전역 스코프(global scope) -> 보통 const로 만듦, 읽기 전용 
// 전역 스코프로 선언된 변수와 함수는 코드 어디에서나 접근 가능
// 프로그램이 실행되는 동안 계속 유지
let test = '전역 스코프';

function output() {
  // 함수 안에 선언된 변수등을 지역(local) 스코프라고함
  // 함수 내에서 선언 된 변수와 함수는 해당 함수 내부에서 유효
  // 함수가 실행될 때마다 새로운 지역 스코프가 생성됨
  let test = '지역 스코프';
  if(true) {
    let test = '블록레벨 스코프'
    // 보통은 test = '블록레벨 스코프'로 재할당해서 쓰는게 대부분 -> 헷갈림
    // 중괄호로 둘러싸인 범위로 나뉘는 스코프
    console.timeLog(test);
  }
  console.log(test);
}

output();
console.log(test);


// 스코프 체인: 일단 나랑 같은 레벨의 스코프에서 먼저 찾은 다음에 없으면 그 위에 있는 변수값을 가져감
// 내 지역에 없으면 전역 스코프에서 내 변수 값을 찾는다
